//
//  regionData.swift
//  SimSaSukSo
//
//  Created by 이현서 on 2021/07/25.
//
import UIKit
struct regionData{

static var seoulList = ["강남 / 역삼 / 삼성","서초 / 교대 / 방배","사당","신사 / 압구정 / 청담","잠실 / 송파 / 잠실새내 / 천호 / 강동","서울역 / 이태원 / 용산","명동 / 중구","을지로 / 충무로","종로 / 동대문 / 대학로","인사동","서대문 / 마포 / 신촌 / 홍대","영등포","여의도","신림 / 서울대","구로 / 금천","김포공항","강서 / 화곡","건대 / 성수","왕십리","군자 / 상봉 / 중랑구","장안 / 청량리","강북 / 수유 / 도봉 / 미아 / 성북 / 노원"]

static var busanList = ["해운대","광안리 / 센텀","경성대","송정 / 기장","부산역","남포 / 자갈치","송도","서면 / 양정","동래","연산","금정","사상","명지","화명","신호 / 하단"]

static var jejuList = ["애월","한림 / 협재","성산","조천 / 함덕","남원 / 표선","구좌 / 용눈이오름","모슬포항 / 대정 / 산방산 / 안덕="]
static var gangwonList = ["고성","동해 / 정선","삼척","춘천 / 강촌 / 남이섬","홍천","원주","영월","태백","평창","횡성","인제 / 철원 / 양구 / 화천"]
static var gyeonggiList = ["수원 / 인계 / 권선 / 영통","장안 / 팔달","용인","평택","안산 / 대부도","부천","시흥 / 광명","파주 / 고양 / 김포","화성 / 제부도 / 오산","가평","양평 / 용문","청평","안성","성남","의정부","포천 / 동두천","연천","안양","의왕 / 군포","남양주 / 구리 / 하남","여주 / 이천","양주"]

static var incheonList = ["강화","인천국제공항","송도 / 연수구","을왕리 / 월미도","영종도","청라","부평","주안","계양","미추홀","옹진군"]
static var deaguList = ["달서구 / 성서 / 죽전 / 본리","동구 / 동대구역 / 대구공항","수성구 / 수성못 / 두산 / 지산","중구 / 동성로","북구 / 경북대","서구 / 비산","남구 / 봉덕","달성군"]
static var ulsanList = ["남구 / 삼산 / 중구 / 성남","동구 / 북구 / 울주군"]
static var gyeongnamList = ["거제","통영","남해","사천 / 진주","고성","창원","김해","양산","밀양 / 합천","하동","산청","창녕"]
static var gyeonbukList = ["경주","포항","울릉","구미 / 김천","구미 / 김천","울진","경산 / 영천","청도","문경","상주","성주","안동","영주"]
static var gwangjuList = ["서구 / 상무 / 유스퀘어","광산구 / 첨단 / 송정역 / 하남","동구 / 동명동 / 충장로 / 남구","북구 / 광주역 / 전남대사거리"]
static var jeonnamList = ["여수","순천 / 광양","구례","목포","해남","완도","보성","나주","담양 / 영광","무안","신안","고흥","화순"]
static var jeonbukList = ["전주","군산","부안","고창","남원 / 순창","익산","완주","무주"]
static var daejeonList = ["유성구 / 충남대","중구 / 은행 / 서대전역","동구 / 대덕구 / 신탄진","서구 / 둔산 / 대전시청"]
static var chungnamList = ["천안","아산","태안 / 안면도","세종","금산","공주","부여","보령","서산","논산","서천","계룡","당진"]
static var chungbukList = ["청주 / 진천","제천 / 충주","단양","괴산","음성","보은","영동"]
}
